---
kind: property
id: P:Autodesk.Revit.DB.FootPrintRoof.Overhang(Autodesk.Revit.DB.ModelCurve)
source: html/279cd69c-78c3-d9a0-a79c-4dd7bb48973e.htm
---
# Autodesk.Revit.DB.FootPrintRoof.Overhang Property

Retrieve or set the Overhang of the curve.

## Syntax (C#)
```csharp
public double this[
	ModelCurve pCurve
] { get; set; }
```

## Parameters
- **pCurve** (`Autodesk.Revit.DB.ModelCurve`)

## Remarks
Only applicable when the FootPrintRoof is created with Pick Walls.